{
    "first-name": "Garrett",
    "last-name": "Holmes",
    "location": "Toronto, ON",
    "phone": "647-470-2263",
    "email": "garrett.a.holmes01@gmail.com",
    "linkedIn": "https://www.linkedin.com/in/garrett-a-holmes/",
    "website": "ga-holmes.github.io",
    "github": "ga-holmes",
    "summary": "I'm a graduate student at Toronto Metropolitan University in the Spatial Analysis Program, with lots of experience with computer science, software development, GIS, and spatial analysis, looking to for opportunities to expand my skillset and explore interesting ideas and projects.",
    "long-summary": "I'm a graduate student at Toronto Metropolitan University in the Master of Spatial Analysis program. With a High Honours Undergraduate degree in Computer Science from the University of Guelph I am a strong programmer with a background in python, C, and Javascript programming, having worked in computer vision and as a small-scale web developer. I'm a passionate about the outdoors and the environment, having worked as an outdoor educator and canoe camping guide. I've worked with the Toronto and Region Conservation Authority (TRCA) and Ducks Unlimited Canada in their conservation efforts in Southern Ontario.  My current research addresses salt vulnerability in urban watersheds and aims to use GIS and spatial analysis technology to identify salt-vulnerable-vulnerable areas in the Greater Toronto Area.",
    "certifications": [
        {
            "type": "Certifications",
            "list": ["SmartServe", "Emergency First Aid", "Wilderness First Responder"]
        }
    ],
    "skills": [
        {
            "type": "Programming Languages",
            "list": ["C", "Python", "SQL", "Java", "HTML", "CSS", "Javascript"]
        },
        {
            "type": "GIS Tools",
            "list": ["ESRI Products", "ArcGIS", "QGIS", "WhiteboxTools", "arcpy", "SPSS", "Spatial Databases", "geopandas"]
        },
        {
            "type": "Software Environments",
            "list": ["Linux/UNIX", "React", "React Native", "NodeJS", "LaTeX", "SQL DBMS"]
        },
        {
            "type": "Artificial Intelligence",
            "list": ["AI Models", "PyTorch", "numpy", "RCNN"]
        },
        {
            "type": "Office Tools",
            "list": ["Microsoft Office", "Excel", "Adobe Suite", "LaTeX"]
        },
        {
            "type": "Creative Skills",
            "list": ["Photography, Videography, 2D animations", "Video Production", "Video Editing"]
        }
    ],
    "education": [
        {
            "school": "Toronto Metropolitan University",
            "program": "Master of Spatial Analysis",
            "points": [
                "Ongoing Thesis"
            ],
            "courses": [
                "Database Management and Spatial Technology", "Applied Spatial Statistics", "Cartography and Geovisualization", "GIS Project Management Applications", "Remote Sensing"
            ],
            "year": "Sept 2024 -",
            "location": "Toronto, ON"
        },
        {
            "school": "University of Guelph",
            "program": "Honours Bachelor of Computing, Major in Computer Science, Minor in Geographic Information Systems and Environmental Analysis",
            "points": [
                "Graduated with Distinction."
            ],
            "courses": [
                "Software Engineering", "Software Development", "Computational Intelligence", "Computer Graphics", "Cloud Computing", "Parallel Programming", "Network Programming", "Systems Programming", "Compilers", "Remote Sensing", "Applied Geomatics"
            ],
            "year": "Sept 2019 - Dec 2023",
            "location": "Guelph, ON"
        }
    ],
    "projects": [
        {
            "title": "Site Suitability Index for Small Wetlands in Southern Ontario",
            "description": "Worked with Ducks Unlimited Canada to research and build an index model for identifying wetland conservation and conversion sites.",
            "points": [
                "Performed literature review of research on key wetland features and conservation.",
                "Used GIS software to normalize data layers and create a suitability index using a Multi-Criteria-Evaluation approach.",
                "Part of GIS Project Management Applications Course at TMU"
            ],
            "relevant-skills": ["GIS"],
            "year": "Fall 2024",
            "location": "Toronto Metropolitan University"
        },
        {
            "title": "Evaluating Toronto's Bike Share Program",
            "description": "A map poster exploring the use of and access to bike share in the city of Toronto.",
            "points": [
                "Worked with large datasets representing millions of ridership records",
                "Using GIS software to consolidate and map ridership across the city of Toronto in 2024.",
                "Part of Cartography and Geovisualization Course at TMU"
            ],
            "relevant-skills": ["GIS"],
            "year": "Fall 2024",
            "location": "Toronto Metropolitan University"
        },
        {
            "title": "Productivity Apps",
            "description": "A collection of finished and work-in-progress repositories with simple productivity tools available through my github page.",
            "points": [
                "budget-tracker-app for keeping track of day-to-day expenses written with React Native",
                "mass-image-reseizer using openCV to resize images from a folder",
                "pdf-combine-script a simple way of combining pdf files"
            ],
            "relevant-skills": ["git-personal"],
            "year": "",
            "location": ""
        },
        {
            "title": "Analysis of Toronto Bike Share Program",
            "description": "Exploring public information from the City of Toronto on bike infrastructure and bike share usage.",
            "points": [
                "Pulling detailed statistics from public ridership information to analyze bike share usage and growth.",
                "Using python scripting with GIS APIs and Pandas to generate statistics and create geometry.",
                "Map design and information communication."
            ],
            "relevant-skills": ["GIS-personal", "QGIS", "data management"],
            "year": "2024",
            "location": ""
        },
        {
            "title": "Auto Resume",
            "description": "Use a user-defined LaTeX schematic to generate a formatted resume with relevant points from user information.",
            "points": [
                "Designed project overview including formatting of input JSON data.",
                "Developed generic python wrapper to run user-written code corresponding to a given LaTeX format.",
                "Was used to make this resume!",
                "Available on github."
            ],
            "relevant-skills": ["Code-personal", "LaTeX"],
            "year": "2024",
            "location": ""
        },
        {
            "title": "Ant - Director of Photography, Producer",
            "description": "Independently produced feature length film.",
            "points": [
                "Helped plan and execute shooting locations, storyboards, direction, lighting, sound and videography",
                "Operated camera and audio equipment on set.",
                "Worked closely with director and actors to ensure smooth and efficient shoot days.",
                "Intimately involved in pre and post-production processes."
            ],
            "relevant-skills": ["creative", "photography", "videography", "lighting", "organization", "project management"],
            "year": "2024",
            "location": ""
        },
        {
            "title": "Moose Habitat Suitability Modelling in Northern Ontario",
            "description": "Evaluation and analysis of Moose Habitat sustainability in the Missinaibi Forest",
            "points": [
                "Collaborated with students and graduate to identify areas of concern, research plan.",
                "Performed a detailed literature review of moose habitat suitability and environmental concerns related to indstrial logging, including government policy and forestry guidelines.",
                "Investaged and prepared vector data provided through government resources and forestry for analysis.",
                "Derived raster layers and relevant information and developed a Habitat suitability model using ArcGIS pro.",
                "Available through my website."
            ],
            "relevant-skills": ["GIS", "ESRI", "ArcGIS", "Team", "Literature Review", "Enviornmental Analysis", "Data processing", "data management"],
            "year": "2023",
            "location": "University of Guelph"
        },
        {
            "title": "Program Planner Website",
            "description": "Full-stack serviced webpage delivering detailed information about prerequisites, course searching, program informaition using web-scraped university data, built on React.",
            "points": [
                "Used AGILE methodology in a team setting to ensure effective software development as a team leader across multiple sprints",
                "Built user-friendly front end application using React, React Flow and other libraries, Bootstrap, and Javascript.",
                "Organized weekly requirements, scheduled team meetings, lead code review sessions",
                "Used Flask, NGINX, Python for backend development on a Linux server."
            ],
            "relevant-skills": [ "Code", "Javascript", "HTML", "React", "Python", "Full-stack", "AGILE", "Team"],
            "year": "2022",
            "location": ""
        },
        {
            "title": "Sole of a Salesman - Composer",
            "description": "Composed, recordered, and produced soundtrack for independent student short horror film.",
            "points": [
                "Wrote, recorded, and produced music using digital tools and real instruments.",
                "Worked closely with director to match tone of film and assess needs."
            ],
            "relevant-skills": ["communication", "music production", "audio recording"],
            "year": "2022",
            "location": ""
        },
        {
            "title": "The Grove Youth Wellness Hubs App Design",
            "description": "Took part in designing a social media app for a local community partner.",
            "points": [
                "Communicated with client to assemble requirements and key features for a social media app.",
                "Involed Waterfall design methodology to build a development plan, collaborated with team members on requirements and UI design."
            ],
            "relevant-skills": ["Waterfall", "Project Design", "Team", "UI Design", "Application Development"],
            "year": "2021",
            "location": ""
        }
    ],
    "work-experience": [
        {
            "title": "GIS Intern",
            "employer": "Toronto and Region Conservation Authority",
            "points": [
                "Worked with interdisciplinary teams to analyze business and conservation data and create maps and figures.",
                "Used ESRI products to design dashboards, create custom raster functions, support GIS data product creation.",
                "Used Feature Manipulation Engine and python to automate data workflows and generate detailed analytics reports."
            ],
            "relevant-skills": [
                "GIS",
                "team",
                "conservation",
                "intern",
                "trca",
                "python"
            ],
            "year": "2025",
            "location": "Toronto, ON"
        },
        {
            "title": "Electronics Testing and Assembly",
            "employer": "Per Vices Corporation",
            "points": [
                "Worked with engineering team to bring-up and test incoming PCB boards.",
                "Assembled base units and worked with sensitive electronic hardware.",
                "Collaborated in a small team environment to build and ship complex devices."
            ],
            "relevant-skills": ["tech", "team", "electronics", "hardware", "pv"],
            "year": "2024",
            "location": "Toronto, ON"
        },
        {
            "title": "Technical Manager",
            "employer": "Hardest Working Realty Team",
            "points": [
                "Responsible for maintaining team website, adding and editing listings, creating new sections and UI elements.",
                "Performed migration of all static pages to pages using dynamically stored listing data using a CMS.",
                "Consulting on all forms of technical questions relating to domains, email, cloud storage, personal devices, etc."
            ],
            "relevant-skills": ["Code", "web"],
            "year": "2024 - ",
            "location": "Toronto, ON"
        },
        {
            "title": "Outdoor Educator",
            "employer": "Kandalore Outdoor Education Centre",
            "points": [
                "Lead school groups grades 6 to 11 in educational and team-building activities as a group leader.",
                "Interacted with teachers to ensure quality leadership for their students during their time at Kandalore.",
                "Facilitated technical activities including indoor and outdoor rock climbing, high ropes course, map orienteering, etc.",
                "Worked with dedicated staff team to maintain a functioning site including a variety of manual labour and maintenance tasks."
            ],
            "relevant-skills": ["OEC", "leadership", "hard skills", "climbing", "team", "education", "outdoors", "maintenance", "communication", "management"],
            "year": "2023, 2024",
            "location": "Kawartha Highlands, ON"
        },
        {
            "title": "Rock Climbing Monitor",
            "employer": "University of Guelph Athletic Centre",
            "points": [
                "Helped build and maintain a thriving community of climbing enthusiasts on campus.",
                "Interacted personally with patrons and provided quality service to members",
                "Facilitated orientations, “Learn to Climb” sessions, first aid support, taught belay certification.",
                "Managed sale of rock climbing equipment and assessed needs of customers."
            ],
            "relevant-skills": ["climbing", "athletics", "customer service", "community engagement", "products", "support"],
            "year": "2022/2023",
            "location": "Guelph, ON"
        },
        {
            "title": "Undergraduate Research Assistant",
            "employer": "University of Guelph",
            "points": [
                "Worked under Dr. Stacey Scott to review and summarize academic publications relating precision agriculture and computer vision.",
                "Self-directed research of contemporary neural network concepts and methods.",
                "Exploration of Mask-RCNN, YOLO, detectron2 API networks.",
                "Used PyTorch and OpenCV to train a residual neural network to classify cattle in frames of video to support concurrent agriculture research.",
                "Code available on github."
            ],
            "relevant-skills": ["Code", "AI", "research", "Literature Review", "Python", "openCV", "Computer Vision", "MaskRCNN", "resnet", "neural networks", "Application Development", "pytorch", "numpy"],
            "year": "2022",
            "location": "Guelph, ON"
        },
        {
            "title": "Camp Counselor/River Guide",
            "employer": "Camp Kandalore",
            "points": [
                "Facilitated camp activities including ORCA canoe progression, nature walks, sailing as well as assigned-cabin activities.",
                "Planned and organized 3-to-7-day white-water and flat-water wilderness canoe camping trips for groups of 8 to 10 campers.",
                "Worked with staff to ensure safe environments for learning and adventure. Promoted clean and sustainable camping practices.",
                "Monitored group dynamics and encouraged growth of teamwork and communication skills among campers.",
                "Maintained a clean environment in-camp including boat repair and site maintenance."
            ],
            "relevant-skills": ["leadership", "hard skills", "management", "team", "education", "outdoors", "maintenance", "communication"],
            "year": "2019/2021",
            "location": "Kawartha Highlands, ON"
        },
        {
            "title": "Cook",
            "employer": "Stampede Ranch",
            "points": [
                "Worked in a fast-paced high-pressure environment to ensure timely delivery of quality prepared food.",
                "Maintained a clean and organized work environment including closing procedures.",
                "Worked with other staff in team environment to maintain efficient work environment."
            ],
            "relevant-skills": ["fast-paced", "service", "cooking", "organization"],
            "year": "2020",
            "location": "Guelph, ON"
        }
    ],
    "volunteer-experience":[
        {
            "title": "Quartermaster",
            "organization": "University of Guelph Outdoors Club",
            "points": [
                "Student-run club dedicated to outdoor enthusiats on campus, oranizing events including canoe and hiking trips, as well as outdoors gear rentals.",
                "Assisted club members in finding and renting club equipment, handled deposits and safe boxes.",
                "Maintained and organized gear inventory, gear condition, etc."
            ],
            "relevant-skills": ["organization", "customer service", "maintenance", "management", "outdoors"],
            "year": "2021 - 2023",
            "location":"Guelph, ON"
        }
    ],
    "achievements": [
        {
            "award": "Graduated with Distinction",
            "event": "University of Guelph",
            "location": "Guelph, ON",
            "year": "2023"
        }
    ]
}